<a href="https://colab.research.google.com/github/Raziel-JKM/Kaggle/blob/main/titanic/titanic_by_km.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

[타이타닉 필사 연습](https://kaggle-kr.tistory.com/17?category=868316)

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

plt.style.use('seaborn')
sns.set(font_scale=2.5) # 이 두줄은 본 필자가 항상 쓰는 방법입니다. matplotlib 의 기본 scheme 말고 seaborn scheme 을 세팅하고, 일일이 graph 의 font size 를 지정할 필요 없이 seaborn 의 font_scale 을 사용하면 편합니다.
import missingno as msno

#ignore warings
import warnings
warnings.filterwarnings('ignore')

%matplotlib inline

데이터셋 확인 - 대부분의 캐글 데이터들은 잘 정제되어 있습니다. 하지만 가끔 null data가 존재합니다. 이를 확인하고, 향후 수정합니다.

탐색적 데이터 분석(exploratory data analysis) - 여러 feature 들을 개별적으로 분석하고, feature 들 간의 상관관계를 확인합니다. 여러 시각화 툴을 사용하여 insight를 얻습니다.

feature engineering - 모델을 세우기에 앞서, 모델의 성능을 높일 수 있도록 feature 들을 engineering 합니다. one-hot encoding, class로 나누기, 구간으로 나누기, 텍스트 데이터 처리 등을 합니다.

model 만들기 - sklearn 을 사용해 모델을 만듭니다. 파이썬에서 머신러닝을 할 때는 sklearn 을 사용하면 수많은 알고리즘을 일관된 문법으로 사용할 수 있습니다. 물론 딥러닝을 위해 tensorflow, pytorch 등을 사용할 수 도 있습니다.

모델 학습 및 예측 - trainset 을 가지고 모델을 학습시킨 후, testset 을 가지고 prediction 합니다.

모델 평가 - 예측 성능이 원하는 수준인지 판단합니다. 풀려는 문제에 따라 모델을 평가하는 방식도 달라집니다. 학습된 모델이 어떤 것을 학습하였는 지 확인해봅니다.

In [7]:
df_train = pd.read_csv('/content/test.csv')
df_test = pd.read_csv('/content/test.csv')

In [8]:
df_train.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

survival	생존여부	target label 임. 1, 0 으로 표현됨	

integer Pclass	티켓의 클래스	1 = 1st, 2 = 2nd, 3 = 3rd 클래스로 나뉘며 

categorical feature	integer

sex	성별	male, female 로 구분되며 binary	string

Age	나이	continuous	integer

sibSp	함께 탑승한 형제와 배우자의 수	quantitative	integer

parch	함께 탑승한 부모, 아이의 수	quantitative	integer

ticket	티켓 번호	alphabat + integer	string

fare	탑승료	continuous	float

cabin	객실 번호	alphabat + integer	string

embared	탑승 항구	C = Cherbourg, Q = Queenstown, S = Southampton	string

In [10]:
#dummies 활용
dummies = pd.get_dummies(df_train[['Embarked']])
dummies

     Embarked_C  Embarked_Q  Embarked_S
0             0           1           0
1             0           0           1
2             0           1           0
3             0           0           1
4             0           0           1
..          ...         ...         ...
413           0           0           1
414           1           0           0
415           0           0           1
416           0           0           1
417           1           0           0

[418 rows x 3 columns]

In [13]:
#replace 활용
titanic = df_train.replace({'male':0,'female':1})
titanic

     PassengerId  Pclass  ... Cabin  Embarked
0            892       3  ...   NaN         Q
1            893       3  ...   NaN         S
2            894       2  ...   NaN         Q
3            895       3  ...   NaN         S
4            896       3  ...   NaN         S
..           ...     ...  ...   ...       ...
413         1305       3  ...   NaN         S
414         1306       1  ...  C105         C
415         1307       3  ...   NaN         S
416         1308       3  ...   NaN         S
417         1309       3  ...   NaN         C

[418 rows x 11 columns]

In [14]:
# 데이터 정규화 Fare 데이터 정규화 연습
import pandas as pd

"""
1. 정규화를 수행하는 함수를 구현합니다.
"""
def normal(data):
    
    data = (data-data.min())/(data.max()-data.min())
    
    return data

# 데이터를 읽어옵니다.
titanic = pd.read_csv('/content/test.csv')
print('변환 전: \n',titanic['Fare'].head())

# normal 함수를 사용하여 정규화합니다.
Fare = normal(titanic['Fare'])

# 변환한 Fare 데이터를 출력합니다.
print('\n변환 후: \n',Fare.head())

변환 전:
 0     7.8292
1     7.0000
2     9.6875
3     8.6625
4    12.2875
Name: Fare, dtype: float64

변환 후:
 0    0.015282
1    0.013663
2    0.018909
3    0.016908
4    0.023984
Name: Fare, dtype: float64

In [17]:
# 데이터 표준화 연습
import pandas as pd

"""
1. 표준화를 수행하는 함수를 구현합니다.
"""
def standard(data):
    
    data = (data-data.mean())/data.std()
    
    return data
    
# 데이터를 읽어옵니다.
titanic = pd.read_csv('/content/test.csv')
print('변환 전: \n',titanic['Fare'].head())

# standard 함수를 사용하여 표준화합니다.
Fare = standard(titanic['Fare'])

# 변환한 Fare 데이터를 출력합니다.
print('\n변환 후: \n',Fare.head())

변환 전:
 0     7.8292
1     7.0000
2     9.6875
3     8.6625
4    12.2875
Name: Fare, dtype: float64

변환 후:
 0   -0.497213
1   -0.512045
2   -0.463974
3   -0.482308
4   -0.417469
Name: Fare, dtype: float64

In [18]:
#결츨치 제거 실습 
import pandas as pd
    
# 데이터를 읽어옵니다.
titanic = pd.read_csv('/content/test.csv')
# 변수 별 데이터 수를 확인하여 결측 값이 어디에 많은지 확인합니다.
print(titanic.info(),'\n')

"""
1. Cabin 변수를 제거합니다.
"""
titanic_1 = titanic.drop(columns=['Cabin'])

# Cabin 변수를 제거 후 결측값이 어디에 남아 있는지 확인합니다.
print('Cabin 변수 제거')
print(titanic_1.info(),'\n')

"""
2. 결측값이 존재하는 샘플 제거합니다.
"""
titanic_2 = titanic_1.dropna()

# 결측값이 존재하는지 확인합니다.
print('결측값이 존재하는 샘플 제거')
print(titanic_2.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB
None

Cabin 변수 제거
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 32.8+ KB
None

결측값이 존재하는 샘플 제거
<class 'pandas.core.frame.DataFrame'>
Int64Index: 331 entries, 0 to 415
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  331 non-null    int64
 1   Pclass       331 non-null    int64
 2   Name         331 non-null    object
 3   Sex          331 non-null    object
 4   Age          331 non-null    float64
 5   SibSp        331 non-null    int64
 6   Parch        331 non-null    int64
 7   Ticket       331 non-null    object
 8   Fare         331 non-null    float64
 9   Embarked     331 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 28.4+ KB
None

In [22]:
# (Age 값 - 내림 Age 값) 0 보다 크다면 소수점을 갖는 데이터로 분류합니다.
outlier = titanic_2[titanic_2['Age']-np.floor(titanic_2['Age']) > 0 ]['Age']

print('소수점을 갖는 Age 변수 이상치')
print(outlier)
print('이상치 처리 전 샘플 개수: %d' %(len(titanic_2)))
print('이상치 개수: %d' %(len(outlier)))

"""
1. 이상치를 처리합니다.
"""
titanic_3 = outlier = titanic_2[titanic_2['Age']-np.floor(titanic_2['Age']) == 0 ]['Age'] #이상치 처리
print('이상치 처리 후 샘플 개수: %d' %(len(titanic_3)))

소수점을 갖는 Age 변수 이상치
0      34.50
27     22.50
35     18.50
73     28.50
75     32.50
109    18.50
113    18.50
136    26.50
192    11.50
201     0.33
228    40.50
250     0.92
254    32.50
260    36.50
281     0.75
307     0.83
354     0.17
360    14.50
415    38.50
Name: Age, dtype: float64
이상치 처리 전 샘플 개수: 331
이상치 개수: 19
이상치 처리 후 샘플 개수: 312

In [ ]:
from sklearn.model_selection import train_test_split
#데이터 분리하기 실습
"""
1. feature 데이터와 label 데이터를 분리합니다.
"""
X = titanic_3.drop(columns=['Survived'])
y = titanic_3['Survived']

print('X 데이터 개수: %d' %(len(X)))
print('y 데이터 개수: %d' %(len(y)))

"""
2. 학습용, 평가용 데이터로 분리합니다.
"""
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42) #random_state 전체 데이터에서 비율만큼 뽑게된다.

# 분리한 데이터의 개수를 출력합니다.
print('학습용 데이터 개수: %d' %(len(X_train)))
print('평가용 데이터 개수: %d' %(len(X_test)))
#현재자료에서 서바이브 아예 분리 , 에러남